src/cf/Documents/ЛУРВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛУРВ</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтчетЗаДень</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Начало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Окончание</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тикет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Тикеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаНаТаймлог</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Длительность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФиксированнаяДлительность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/ЛУРВ/Forms/ФормаДокумента/Ext/Form/Module.bsl
// https://its.1c.ru/db/v8std#content:455:hdoc
// Управляемая форма документа «Лист учета рабочего времени» (ЛУРВ).
// Реализует UC-00 (см. Arc/Таймтрекинг.md):
//   - создание дня и первой строки (UC-01, шаги 1-3);
//   - контроль дубля документа на дату (ЛУР-015, шаг 2 UC-00);
//   - пересчёты при ручной правке строк (ЛУР-014, шаги 4-8, 15 UC-00);
//   - команды «СтрокаВверх»/«СтрокаВниз» (ЛУР-011, шаги 11-12 UC-00);
//   - индикаторы статуса синхронизации (ЛУР-009, шаг 9 UC-00);
//   - запоминание прошлых значений строк (ЛУР-012).
// Серверная логика — в модуле объекта документа; форма — тонкая обвязка.
// Клиентские данные (прошлые значения, удаляемая строка) передаются
// параметрами в серверные методы формы.

&НаКлиенте
Перем ПрошлыеЗначенияТекущейСтроки; // ЛУР-012: прошлые значения редактируемой строки

&НаКлиенте
Перем ДанныеУдаляемойСтроки;         // ЛУР-014: данные удаляемой строки (шаг 15 UC-00)

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	обоб = РеквизитФормыВЗначение("Объект");
	// Новый документ: UC-01 (шаги 1-3 UC-00) — дата начала = текущая дата,
	// первая строка добавляется автоматически.
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		обоб.НачатьДень(ТекущаяДата(), ЗадачаПоУмолчаниюНаСервере());
	КонецЕсли;

	ПроверитьДубльДокумента();
	ОбновитьСтатусыСинхронизации();
   ЗначениеВРеквизитФормы(обоб, "Объект");
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НачалоРаботыПриИзменении(Элемент)

	// ЛУР-015: при изменении даты начала контролируется дубль документа на дату
	// (UC-00 шаг 2).
	ПроверитьДубльДокумента();

	// UC-00 шаг 4: смена даты начала работы меняет дату начала первой строки.
	СменитьДатУНачалаПервойСтроки();

КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеРаботыПриИзменении(Элемент)

	// UC-00 шаг 13: указание даты окончания рабочего дня фиксирует
	// дату окончания последней строки.
	ЗафиксироватьОкончаниеПоследнейСтроки();

КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ОтчетЗаДень

&НаКлиенте
Процедура ОтчетЗаДеньПередНачаломИзменения(Элемент, Отказ)

	// ЛУР-012: запоминаем прошлые значения строки для поддержки отмены (Ctrl+Z)
	// и определения факта изменения реквизитов.
	ЗапомнитьПрошлыеЗначенияСтроки(Элемент.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ОтчетЗаДеньПриИзменении(Элемент)

	// ЛУР-014 + ЛУР-012: при изменении реквизитов строки запускаем пересчёты
	// (UC-00 шаги 6-8) и помечаем строку текущим статусом синхронизации (шаг 9).
	// Если 
	ОбработатьИзменениеСтроки(Элемент.ТекущиеДанные, ПрошлыеЗначенияТекущейСтроки);

КонецПроцедуры

&НаКлиенте
Процедура ОтчетЗаДеньНачалоПриИзменении(Элемент)

	// ЛУР-014: изменение начала строки — пересчёт окончания предыдущей
	// и начала следующей (UC-00 шаги 5-6).
	ОбработатьИзменениеНачалаСтроки(Элемент.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ОтчетЗаДеньПередУдалением(Элемент, Отказ)

	// ЛУР-014: запоминаем данные удаляемой строки — время начала следующей
	// строки станет временем начала удаляемой (UC-00 шаг 15).
	ЗапомнитьДанныеУдаляемойСтроки(Элемент.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ОтчетЗаДеньПослеУдаления(Элемент)

	// ЛУР-014: пересчёт после удаления строки (UC-00 шаг 15).
	Индекс = ТекущийИндексАктивнойСтроки();
	ОбработатьУдалениеСтроки(Индекс, ДанныеУдаляемойСтроки);

КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормы_ОтчетЗаДень

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СтрокаВверх(Команда)

	// ЛУР-011 (UC-00 шаг 12): сдвиг строки вверх с сохранением длительностей.
	ПереместитьСтрокуВверх();

КонецПроцедуры

&НаКлиенте
Процедура СтрокаВниз(Команда)

	// ЛУР-011 (UC-00 шаг 11): сдвиг строки вниз с сохранением длительностей.
	ПереместитьСтрокуВниз();

КонецПроцедуры

&НаКлиенте
Процедура СобратьТаймлогиНаДату(Команда)

	// ЛУР-013 (синхронизация) — вне скоупа текущей задачи, оставлена заглушка.
	ПоказатьПредупреждение(, НСтр("ru = 'Собрать таймлоги на дату — будет реализовано в задачах синхронизации.'"));

КонецПроцедуры

&НаКлиенте
Процедура Синхронизировать(Команда)

	// ЛУР-005..007 (синхронизация) — вне скоупа, оставлена заглушка.
	ПоказатьПредупреждение(, НСтр("ru = 'Синхронизация — будет реализована в задачах фасада интеграции.'"));

КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)

	// Кнопка «Отправить» — вне скоупа, оставлена заглушка.
	ПоказатьПредупреждение(, НСтр("ru = 'Отправка — будет реализована в задачах синхронизации.'"));

КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

// ───── ЛУР-012: запоминание прошлых значений <клиент> ─────

&НаКлиенте
Процедура ЗапомнитьПрошлыеЗначенияСтроки(ТекущиеДанные)

	ПрошлыеЗначенияТекущейСтроки = Новый Структура(
		"Начало, Окончание, Тикет, Описание, СсылкаНаТаймлог, Длительность",
		ТекущиеДанные.Начало,
		ТекущиеДанные.Окончание,
		ТекущиеДанные.Тикет,
		ТекущиеДанные.Описание,
		ТекущиеДанные.СсылкаНаТаймлог,
		ТекущиеДанные.Длительность);

КонецПроцедуры

// ───── ЛУР-014: запоминание данных удаляемой строки <клиент> ─────

&НаКлиенте
Процедура ЗапомнитьДанныеУдаляемойСтроки(ТекущиеДанные)

	ДанныеУдаляемойСтроки = Новый Структура(
		"Начало, Окончание, Тикет, Описание, СсылкаНаТаймлог, Длительность",
		ТекущиеДанные.Начало,
		ТекущиеДанные.Окончание,
		ТекущиеДанные.Тикет,
		ТекущиеДанные.Описание,
		ТекущиеДанные.СсылкаНаТаймлог,
		ТекущиеДанные.Длительность);

КонецПроцедуры

&НаКлиенте
Функция ТекущийИндексАктивнойСтроки()

	ТекущаяСтрока = Элементы.ОтчетЗаДень.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат 0;
	КонецЕсли;

	Возврат ТекущаяСтрока;

КонецФункции

// ───── ЛУР-009: индикаторы строк <сервер> ─────

&НаСервере
Процедура ОбновитьСтатусыСинхронизации()

	Для Каждого СтрокаТЧ Из Объект.ОтчетЗаДень Цикл
		СтрокаТЧ.СтатусСинхронизации = СтатусСтрокиПоДанным(СтрокаТЧ);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция СтатусСтрокиПоДанным(СтрокаТЧ)
   обоб = РеквизитФормыВЗначение("Объект");
	// Данные актуальны, если совпадают с кэшем внешней системы (шаг 9 UC-00).
	ДанныеАктуальны = ЗначениеЗаполнено(СтрокаТЧ.ТаймлогДлительность)
		Или ЗначениеЗаполнено(СтрокаТЧ.ТаймлогКомментарий);
	Если ДанныеАктуальны Тогда
		ДанныеАктуальны = СтрокаТЧ.ТаймлогДлительность = СтрокаТЧ.Длительность
			И СтрокаТЧ.ТаймлогКомментарий = СтрокаТЧ.Описание;
	КонецЕсли;

	Возврат обоб.СтатусСинхронизацииСтроки(СтрокаТЧ, ДанныеАктуальны);

КонецФункции

// ───── ЛУР-015: контроль дубля документа на дату <сервер> ─────

&НаСервере
Процедура ПроверитьДубльДокумента()
   обоб = РеквизитФормыВЗначение("Объект");
	ЕстьДубль = обоб.ЕстьДругойДокументНаДату();
	ПоказыватьПометкуДубля = ЕстьДубль;
	Элементы.ПометкаОдублеДокумента.Видимость = ПоказыватьПометкуДубля;

КонецПроцедуры

// ───── UC-00 шаг 4: смена даты начала работы <сервер> ─────

&НаСервере
Процедура СменитьДатУНачалаПервойСтроки()

	Если Объект.ОтчетЗаДень.Количество() > 0 Тогда
		Объект.ОтчетЗаДень[0].Начало = Объект.НачалоРаботы;
		// UC-00 шаги 5-6: пересчёт первой строки и хвоста.
		ЛУРВКлиентСервер.ОбработатьИзменениеНачала(Объект.ОтчетЗаДень, 0);
	КонецЕсли;

КонецПроцедуры

// ───── UC-00 шаг 13: фиксация окончания последней строки <сервер> ─────

&НаСервере
Процедура ЗафиксироватьОкончаниеПоследнейСтроки()

	Если Объект.ОтчетЗаДень.Количество() > 0 Тогда
		ИндексПоследней = Объект.ОтчетЗаДень.Количество() - 1;
		Объект.ОтчетЗаДень[ИндексПоследней].Окончание = Объект.ОкончаниеРаботы;
		// UC-00 шаг 7: пересчёт последней строки после фиксации окончания.
		ЛУРВКлиентСервер.ОбработатьИзменениеОкончания(Объект.ОтчетЗаДень, ИндексПоследней);
	КонецЕсли;

КонецПроцедуры

// ───── ЛУР-014: обработчики таблицы <клиент→сервер> ─────

&НаКлиенте
Процедура ОбработатьИзменениеСтроки(ТекущиеДанные, ПрошлыеЗначения)

	Индекс = Объект.ОтчетЗаДень.Индекс(ТекущиеДанные);
	Если Индекс < 0 Тогда
		Возврат;
	КонецЕсли;
	ОбработатьИзменениеСтрокиНаСервере(Индекс, ПрошлыеЗначения);

КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеСтрокиНаСервере(Индекс, ПрошлыеЗначения)


	Если ПрошлыеЗначения <> Неопределено Тогда
		// Сравниваем с прошлыми значениями (ЛУР-012) и запускаем пересчёты
		// по шагам 7-8 UC-00: изменение окончания или длительности.
		Если Объект.ОтчетЗаДень[Индекс].Окончание <> ПрошлыеЗначения.Окончание Тогда
			ЛУРВКлиентСервер.ОбработатьИзменениеОкончания(Объект.ОтчетЗаДень, Индекс);
		ИначеЕсли Объект.ОтчетЗаДень[Индекс].Длительность <> ПрошлыеЗначения.Длительность Тогда
			ЛУРВКлиентСервер.ОбработатьИзменениеДлительности(Объект.ОтчетЗаДень, Индекс);
		ИначеЕсли Объект.ОтчетЗаДень[Индекс].Начало <> ПрошлыеЗначения.Начало Тогда
			ЛУРВКлиентСервер.ОбработатьИзменениеНачала(	Объект.ОтчетЗаДень, Индекс);
			
		КонецЕсли;
	КонецЕсли;

	ОбновитьСтатусыСинхронизации();

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеНачалаСтроки(ТекущиеДанные)

	ОбработатьИзменениеНачалаСтрокиНаСервере(ТекущиеДанные);

КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеНачалаСтрокиНаСервере(ТекущиеДанные)

	Индекс = Объект.ОтчетЗаДень.Индекс(ТекущиеДанные);
	Если Индекс < 0 Тогда
		Возврат;
	КонецЕсли;

	Если Индекс = 0 И ЗначениеЗаполнено(Объект.ОтчетЗаДень[0].Начало) Тогда
		// Шаг 5 UC-00: изменение начала первой строки меняет дату начала дня.
		Объект.НачалоРаботы = НачалоДня(Объект.ОтчетЗаДень[0].Начало)
			+ ЛУРВКлиентСервер.ВремяНачалаРабочегоДня();
	КонецЕсли;

	// Шаги 5-6 UC-00: пересчёт предыдущей строки и хвоста.
	ЛУРВКлиентСервер.ОбработатьИзменениеНачала(Объект.ОтчетЗаДень, Индекс);
	ОбновитьСтатусыСинхронизации();

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьУдалениеСтроки(Индекс, ДанныеУдаленнойСтроки)

	ОбработатьУдалениеСтрокиНаСервере(Индекс, ДанныеУдаленнойСтроки);

КонецПроцедуры

&НаСервере
Процедура ОбработатьУдалениеСтрокиНаСервере(Индекс, ДанныеУдаленнойСтроки)

	// Шаг 15 UC-00: пересчёт после удаления строки.
	ЛУРВКлиентСервер.ОбработатьУдалениеСтроки(Объект.ОтчетЗаДень, Индекс, ДанныеУдаленнойСтроки);
	ОбновитьСтатусыСинхронизации();

КонецПроцедуры

// ───── ЛУР-011: перемещение строк ─────

&НаКлиенте
Процедура ПереместитьСтрокуВверх()

	ТекущаяСтрока = ТекущийИндексАктивнойСтроки();
	Перемещена = ПереместитьСтрокуВверхНаСервере(ТекущаяСтрока);
	Если НЕ Перемещена Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Нельзя переместить выше'"));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПереместитьСтрокуВниз()

	ТекущаяСтрока = ТекущийИндексАктивнойСтроки();
	Перемещена = ПереместитьСтрокуВнизНаСервере(ТекущаяСтрока);
	Если НЕ Перемещена Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Нельзя переместить ниже'"));
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПереместитьСтрокуВверхНаСервере(Индекс)

	// Шаг 12 UC-00: сдвиг вверх с сохранением длительностей.
	Возврат ЛУРВКлиентСервер.ПереместитьСтрокуВверх(Объект.ОтчетЗаДень, Индекс);

КонецФункции

&НаСервере
Функция ПереместитьСтрокуВнизНаСервере(Индекс)

	// Шаг 11 UC-00: сдвиг вниз с сохранением длительностей.
	Возврат ЛУРВКлиентСервер.ПереместитьСтрокуВниз(Объект.ОтчетЗаДень, Индекс);

КонецФункции

// ───── Задача по умолчанию <сервер> ─────

&НаСервере
Функция ЗадачаПоУмолчаниюНаСервере()

	// В текущей модели настройка администратором не реализована —
	// первая строка создаётся без задачи, сотрудник выбирает тикет на форме.
	Возврат Неопределено;

КонецФункции

&НаКлиенте
Процедура ОтчетЗаДеньПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОтчетЗаДеньПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
   ТекСтрока = Элемент.ТекущиеДанные;
	Если НоваяСтрока Тогда
		// UC-03: новая строка начинается с текущего момента.
		ТекСтрока.Начало = ОбщегоНазначенияКлиент.ДатаСеанса();
		// ЛУР-012: прошлые значения — значения самой новой строки. Иначе
		// ПриИзменении сравнит её со значениями ранее редактированной строки
		// и запустит пересчёты по ложным дельтам (затирание начала предыдущей).
		ЗапомнитьПрошлыеЗначенияСтроки(ТекСтрока);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
